# Практика переменные
# a = 2
# b = 0.5
# print(a+b)
#
# name = 'Вячеслав'
# print(f'Привет, {name}!')

# Практика числа

# v = input('Введите число от 1 до 10: ')
# print(int(v)+10)

# Практика строки

# поправьте код, чтобы выводилась строка
# Привет, ИМЯ! Как дела?

# name = input('Введите ваше имя: ')
# print(f'Привет, {name}, Как дела?')

# print(float('1')) # 1.0
# print(int('2.5'))  # ValueError (кавычки лишние, приводит к целочисленным двум без них)
# print(bool(1))  # True
# print(bool(''))  # False
# print(bool(False))  # False


